InformationRegisters/НастройкаМатрицыТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаМатрицыТалантов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьМатрицуТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаМатрицыТалантов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиМатрицыТалантов() Экспорт
	
	Результат = НовыеДанныеМатрицыТалантов();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаМатрицыТалантов.ВысокаяОценкаЭффективности КАК ВысокаяОценкаЭффективности,
		|	НастройкаМатрицыТалантов.СредняяОценкаЭффективности КАК СредняяОценкаЭффективности,
		|	НастройкаМатрицыТалантов.ВысокаяОценкаПотенциала КАК ВысокаяОценкаПотенциала,
		|	НастройкаМатрицыТалантов.СредняяОценкаПотенциала КАК СредняяОценкаПотенциала
		|ИЗ
		|	РегистрСведений.НастройкаМатрицыТалантов КАК НастройкаМатрицыТалантов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьШкалыМатрицыТалантов(Форма, Настройки) Экспорт
	
	Форма.ШкалаПотенциалаМатрицыТалантов.Загрузить(ШкалаПотенциала(Настройки));
	Форма.ШкалаЭффективностиМатрицыТалантов.Загрузить(ШкалаЭффективности(Настройки));
	УстановитьУсловноеОформлениеШкалыЗначений(Форма.УсловноеОформление, "ШкалаПотенциалаМатрицыТалантов");
	УстановитьУсловноеОформлениеШкалыЗначений(Форма.УсловноеОформление, "ШкалаЭффективностиМатрицыТалантов");
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеШкалыЗначений(УсловноеОформление, ИмяТаблицы) Экспорт
	
	ПолеПредставления = ИмяТаблицы + ".ЗначениеПредставление";
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	СвойствоЭлементОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Текст");
	СвойствоЭлементОформления.Значение = Новый ПолеКомпоновкиДанных(ПолеПредставления);
	СвойствоЭлементОформления.Использование = Истина;
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеПредставления);
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбораДанных.Использование = Истина;
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "Значение");
	ОформляемоеПоле.Использование = Истина; 
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	СвойствоЭлементОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ТолькоПросмотр");
	СвойствоЭлементОформления.Значение = Истина;
	СвойствоЭлементОформления.Использование = Истина;
	
	ГруппаОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораДанных.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбораДанных1 = ГруппаОтбораДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".Значение");
	ЭлементОтбораДанных1.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных1.ПравоеЗначение = 100;
	ЭлементОтбораДанных1.Использование = Истина;
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "Значение");
	ОформляемоеПоле.Использование = Истина;
	
КонецПроцедуры

Функция ЗаполнитьРегистрПоУмолчанию(Настройка) Экспорт
	
	Если Настройка.ИспользоватьМатрицуТалантов Тогда
		ЗаполнитьРесурсПоУмолчанию(Настройка, "ВысокаяОценкаЭффективности", 66);
		ЗаполнитьРесурсПоУмолчанию(Настройка, "СредняяОценкаЭффективности", 33);
		ЗаполнитьРесурсПоУмолчанию(Настройка, "ВысокаяОценкаПотенциала", 66);
		ЗаполнитьРесурсПоУмолчанию(Настройка, "СредняяОценкаПотенциала", 33);
	КонецЕсли;
	
КонецФункции

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьТаблицуШкалы()
	
	Шкала = Новый ТаблицаЗначений;
	Шкала.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	Шкала.Колонки.Добавить("Значение", ОбщегоНазначения.ОписаниеТипаЧисло(5, 2));
	Шкала.Колонки.Добавить("ЗначениеПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	
	Возврат Шкала;
	
КонецФункции

Процедура ДобавитьСтрокуТабличнойЧасти(Таблица, Описание, ЗначениеДо, ЗначениеОт = 0)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Описание = Описание;
	НоваяСтрока.Значение = ЗначениеДо;
	
	Если ЗначениеОт = 0 Тогда
		НоваяСтрока.ЗначениеПредставление = СтрШаблон(НСтр("ru = 'менее %1%%'"), ЗначениеДо);
	Иначе
		НоваяСтрока.ЗначениеПредставление = СтрШаблон(НСтр("ru = 'от %1%% до %2%%'"), ЗначениеОт, ЗначениеДо);
	КонецЕсли;
	
КонецПроцедуры

Функция НовыеДанныеМатрицыТалантов()
	
	ДанныеМатрицы = Новый Структура;
	ДанныеМатрицы.Вставить("ВысокаяОценкаЭффективности", 66);
	ДанныеМатрицы.Вставить("СредняяОценкаЭффективности", 33);
	ДанныеМатрицы.Вставить("ВысокаяОценкаПотенциала", 66);
	ДанныеМатрицы.Вставить("СредняяОценкаПотенциала", 33);
	
	Возврат ДанныеМатрицы;
	
КонецФункции

Функция ШкалаПотенциала(НастройкиМатрицыТалантов)
	
	ДанныеМатрицы = НовыеДанныеМатрицыТалантов();
	Если НастройкиМатрицыТалантов.ВысокаяОценкаПотенциала <> 0 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеМатрицы, НастройкиМатрицыТалантов);
	КонецЕсли;
	
	Шкала = СоздатьТаблицуШкалы();
	ДобавитьСтрокуТабличнойЧасти(Шкала, НСтр("ru = 'Низкий'"), ДанныеМатрицы.СредняяОценкаПотенциала);
	ДобавитьСтрокуТабличнойЧасти(Шкала, НСтр("ru = 'Средний'"), ДанныеМатрицы.ВысокаяОценкаПотенциала, ДанныеМатрицы.СредняяОценкаПотенциала);
	ДобавитьСтрокуТабличнойЧасти(Шкала, НСтр("ru = 'Высокий'"), 100, ДанныеМатрицы.ВысокаяОценкаПотенциала);
	
	Возврат Шкала;
	
КонецФункции

Функция ШкалаЭффективности(НастройкиМатрицыТалантов)
	
	ДанныеМатрицы = НовыеДанныеМатрицыТалантов();
	Если НастройкиМатрицыТалантов.ВысокаяОценкаЭффективности <> 0 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеМатрицы, НастройкиМатрицыТалантов);
	КонецЕсли;
	
	Шкала = СоздатьТаблицуШкалы();
	ДобавитьСтрокуТабличнойЧасти(Шкала, НСтр("ru = 'Низкая'"), ДанныеМатрицы.СредняяОценкаЭффективности);
	ДобавитьСтрокуТабличнойЧасти(Шкала, НСтр("ru = 'Средняя'"), ДанныеМатрицы.ВысокаяОценкаЭффективности, ДанныеМатрицы.СредняяОценкаЭффективности);
	ДобавитьСтрокуТабличнойЧасти(Шкала, НСтр("ru = 'Высокая'"), 100, ДанныеМатрицы.ВысокаяОценкаЭффективности);
	
	Возврат Шкала;
	
КонецФункции

Функция ЗаполнитьРесурсПоУмолчанию(Настройка, ИмяРесурса, Значение)
	
	Настройка[ИмяРесурса] = ?(Настройка[ИмяРесурса] = 0, Значение, Настройка[ИмяРесурса]);
	
КонецФункции

#КонецОбласти

#КонецЕсли
